Изменения типовой конфигурации/src/Catalogs/Изм_ТехническиеПроекты/Изм_ТехническиеПроекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Изм_ТехническиеПроекты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолноеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрименения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Изм_СтатусыТехническихПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.Изм_ИнформационныеБазы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененныеМетаданные</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ссылки</name>
    <attributes>
      <name>АдресСсылки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСсылки</name>
      <type>
        <types>CatalogRef.Изм_ТипыСсылок</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Изменения типовой конфигурации/src/Catalogs/Изм_Коммиты/Изм_Коммиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Изм_Коммиты</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСвязьСТехПроектами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ПутьКФайлу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распознан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененныеМетаданные</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеПроекты</name>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.Изм_ТехническиеПроекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Изменения типовой конфигурации/src/Catalogs/Изм_ТехническиеПроекты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПолноеОписание = ТекущийОбъект.ПолноеОписание.Получить(); 
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПолноеОписание = Новый ХранилищеЗначения(ПолноеОписание);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоммитыТехПроекта.Параметры.УстановитьЗначениеПараметра("ТехПроект", Объект.Ссылка);    
	УстановитьПиктограммыСсылок(); 
	ПодсчитатьКоличествоКоммитов();
	УстановитьРодителяМетаданных();
КонецПроцедуры


Процедура УстановитьПиктограммыСсылок()
	ТипыСсылок = Объект.Ссылки.Выгрузить(, "ТипСсылки").ВыгрузитьКолонку("ТипСсылки");
	ТипыСсылок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипыСсылок);
	АдресаПиктограмм = Новый Соответствие;
	Для каждого ТипСсылок Из ТипыСсылок Цикл
		АдресаПиктограмм.Вставить(ТипСсылок, ПолучитьНавигационнуюСсылку(ТипСсылок, "Пиктограмма"));
	КонецЦикла; 
	Для каждого Строка Из Объект.Ссылки Цикл
		Строка.АдресПиктограммы = АдресаПиктограмм[Строка.ТипСсылки]; 
	КонецЦикла;
КонецПроцедуры

Процедура ПодсчитатьКоличествоКоммитов()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		КоличествоКоммитов = 0;
		Возврат ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Количество(1) как Количество
	|ИЗ
	|	Справочник.Изм_Коммиты КАК СправочникИзм_Коммиты
	|ГДЕ
	|	СправочникИзм_Коммиты.ТехническиеПроекты.ТехническийПроект = &ТехПроект";
	
	Запрос.УстановитьПараметр("ТехПроект", Объект.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	КоличествоКоммитов =  ТаблицаРезультата[0].Количество;
КонецПроцедуры

&НаКлиенте
Процедура СсылкиПередНачаломИзменения(Элемент, Отказ)  
	Отказ = Истина;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеСсылкиЗавершение", ЭтотОбъект, ТекущиеДанные);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипСсылки", ТекущиеДанные.ТипСсылки);
	ПараметрыФормы.Вставить("АдресСсылки", ТекущиеДанные.АдресСсылки);
	ПараметрыФормы.Вставить("Описание", ТекущиеДанные.Описание);
	ОткрытьФорму("ОбщаяФорма.Изм_ФормаРедактированияСсылки", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСсылкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Результат); 
	КонецЕсли;
	УстановитьПиктограммыСсылок();
КонецПроцедуры

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)    
	Отказ = Истина;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеСсылкиЗавершение", ЭтотОбъект);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипСсылки", "");
	ПараметрыФормы.Вставить("АдресСсылки", "");
	ПараметрыФормы.Вставить("Описание", "");
	ОткрытьФорму("ОбщаяФорма.Изм_ФормаРедактированияСсылки", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеСсылкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда                   
		НоваяСтрока = Объект.Ссылки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат); 
	КонецЕсли;
	УстановитьПиктограммыСсылок();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПиктограммыСсылок();
КонецПроцедуры

&НаКлиенте
Процедура СсылкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СсылкиОписание" Тогда    
		СтандартнаяОбработка = Ложь;
		СтрокаСДанными = Объект.Ссылки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаСДанными.АдресСсылки);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьРодителяМетаданных()
	МассивМетаданных = Объект.ИзмененныеМетаданные.Выгрузить(, "ОбъектМетаданных").ВыгрузитьКолонку("ОбъектМетаданных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Родитель КАК Родитель,
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	ИдентификаторыОбъектовМетаданных.Родитель.Имя КАК РодительИмя
	
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовРасширений.Родитель,
	|	ИдентификаторыОбъектовРасширений.Ссылка,
	|	ИдентификаторыОбъектовРасширений.Родитель.Имя
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовРасширений КАК ИдентификаторыОбъектовРасширений
	|ГДЕ
	|	ИдентификаторыОбъектовРасширений.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивМетаданных);
	
	Родители = Запрос.Выполнить().Выгрузить();
	Родители.Индексы.Добавить("Ссылка");
	
	Для каждого Строка Из Объект.ИзмененныеМетаданные Цикл      
		НайденнаяСтрока = Родители.Найти(Строка.ОбъектМетаданных, "Ссылка");
		Строка.Родитель = НайденнаяСтрока.Родитель; 
		Строка.Картинка = КартинкаМетаданных(НайденнаяСтрока.РодительИмя);
	КонецЦикла;
	Объект.ИзмененныеМетаданные.Сортировать("Родитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененныеМетаданныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьРодителяМетаданных();
КонецПроцедуры 

Функция КартинкаМетаданных(ИмяОбъекта)
	Картинка = Неопределено;
	ШаблонИмениКартинки = "Метаданные%1";
	ИмяКартинки = СтрШаблон(ШаблонИмениКартинки, ИмяОбъекта);
	Попытка
		Возврат БиблиотекаКартинок[ИмяКартинки];
	Исключение
		Возврат Картинка;
	КонецПопытки;;
КонецФункции // ()
